Tekla.Structures.Model.Events.ModelObjectChangedDelegate
The delegate to use for changed model objects.
ModelObject inside ChangeData contains only identifier information. If properties need to be checked, Select() for object is required.